// Задача 1: Задайте одномерный массив из 10 целых
// чисел от 1 до 100. Найдите количество элементов
// массива, значения которых лежат в отрезке [20,90]. 
// массив [10 21 14 93 23] => 2


int[] array = new int[] {1, 13, 45, 23, 64, 20, 39, 90, 95, 47};
int count = 0;
foreach(int number in array)
{
    if(number > 20 && number < 90)
        count++;
} 
System.Console.WriteLine(count);
